//Домашнее задание №22
//Курс
//«Объектно - ориентированное
//программирование на C++»
//Встреча №22
//Тема : Исключения

//Задание 1.
//Добавьте в класс двусвязного списка механизм обработ -
//ки исключений.На ваш выбор генерируйте исключения
//в случае ошибок.Например, нехватка памяти, попытка
//удаления из пустого списка и т.д.
// 
//Задание 2.
//Создайте иерархию пользовательских классов - исклю -
//чений.В ней должны быть классы для разных ситуа -
//ций.В качестве предметной области используйте ваши
//практические и домашние задания.Например, должны
//присутствовать классы для обработки всевозможных
//математических ошибок, нехватки памяти, проблемам
//по работе с файлами и т.д.
//
//Встреча №23
//Тема : Пространства имен
// 
//Задание 3
//В рамках предыдущих самостоятельных и домашних за -
//даний вы создали набор классов по работе с различными
//примитивными математическими операциями(дробь,
//	точка в двумерном пространстве, точка в трехмерном
//	пространстве и т.д.).Разместите уже созданные классы
//	в пространствах имен.Продумайте правильную структуру
//	созданных пространств.Используя механизм пространств
//	напишите код по тестированию полученного решения.