//“ема: динамические структуры данных Ч односв€зный список
//«адание 1.
//–еализуйте стек в виде односв€зного списка.
// “ребуетс€ реализовать типичные операции по работе со стеком.
//ѕри переполнении стека нужно увеличивать его размер.
// 
// «адание 2.
//¬ существующий класс односв€зного списка добавить :
//операцию клонировани€ списка
// (функци€ должна возвращать адрес головы клонированного списка), 
// перегрузить	оператор + 
// (оператор должен возвращать адрес головы	нового списка, содержащего элементы обоих списков дл€ которых вызывалс€ оператор),
// перегрузить оператор*
//(оператор должен возвращать адрес головы нового списка,	содержащего только общие элементы обоих списков дл€	которых вызывалс€ оператор).